Функция ВыводСобытий(Список) Экспорт
	Сообщение = "";
	Для Каждого Элемент Из Список Цикл
		Сообщение = Сообщение + Символы.ПС + Строка(Элемент.Значение) + " - " + Элемент.Представление;
	КонецЦикла;
	Возврат Сообщение;
КонецФункции

Процедура ДобавитьСобытие_1(Список) Экспорт
	Год = 0;
	Название = "";
	ВвестиСтроку(Название, "Введите название нового события");
	ВвестиЧисло(Год, "Введите год нового события");
	Список.Добавить(Год, Название);
КонецПроцедуры

Процедура ОчиститьСобытия_2(Список) Экспорт
	Результат = Вопрос("Вы уверены что хотите очистить список событий?", РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Да Тогда
		Список.Очистить();
	КонецЕсли;
КонецПроцедуры

Процедура СортироватьСобытия_3(Список) Экспорт
	Список.СортироватьПоЗначению();
КонецПроцедуры

Процедура ВывестиПоГоду_4(Список) Экспорт
	Год = 0;
	ВвестиЗначение(Год, "Введите год");
	Если Список.НайтиПоЗначению(Год) = Неопределено Тогда
		ОткрытьЗначение("Извините, в этот год ничего не произошло");
	Иначе
		ТекстСобытий = "";
		Для Каждого Событие Из Список Цикл
			Если Год = Событие.Значение Тогда
				ТекстСобытий = ТекстСобытий + Символы.ПС + Строка(Событие.Значение) + " - " + Событие.Представление;
			КонецЕсли;
		КонецЦикла;
		ОткрытьЗначение(ТекстСобытий);
			
	КонецЕсли;
КонецПроцедуры
