Процедура ВыводМассива(Элементы) Экспорт 
	Для Каждого Элемент Из Элементы Цикл
		Сообщить(Элемент);
	КонецЦикла;
КонецПроцедуры 

Процедура Перемешать(Элементы) Экспорт   // Случайным образом перемешиваются элементы массива
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Для Шаг = 0 По Элементы.Количество() - 1 Цикл
		К = ГСЧ.СлучайноеЧисло(0, Элементы.Количество() - 1);
		Если Шаг <> К Тогда
			Число = Элементы[Шаг];		
			Элементы[Шаг] = Элементы[К];
			Элементы[К] = Число; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура Сортировка(Элементы) Экспорт
	Для ВнешШаг = 1 По Элементы.Количество() - 1 Цикл 
		Обмен = Ложь;
		Для ВнутрШаг = 1 По Элементы.Количество() - 1 Цикл 
			Если Элементы[ВнутрШаг - 1] > Элементы[ВнутрШаг] Тогда
				Переменная = Элементы[ВнутрШаг - 1];
				Элементы[ВнутрШаг - 1] = Элементы[ВнутрШаг];
				Элементы[ВнутрШаг] = Переменная;
				Обмен = Истина;
			КонецЕсли;
		КонецЦикла;  
		Если Не Обмен Тогда   //Если не было обмена сортировка завершена
			Прервать;
		КонецЕсли;	
	КонецЦикла; 
КонецПроцедуры

Функция УмножениеМассива(Числа) Экспорт  //Умножение элемента массива на свой порядковый нормер
	Элементы = Новый Массив(Числа.Количество());
	Для Шаг = 0 По Числа.Количество()-1 Цикл
		Элементы[Шаг] = Числа[Шаг] * Шаг;
	КонецЦикла;
	Возврат Элементы;
КонецФункции

		